## qcon-demo-org plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # github_repository.repo2 will be created
+   resource "github_repository" "repo2" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = false
+       allow_squash_merge          = true
+       archived                    = false
+       auto_init                   = false
+       branches                    = (known after apply)
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "Test repo2"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "repo2"
+       node_id                     = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       visibility                  = "public"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```